## Website CMS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_acm_certificate.strapi`                                      |
|        | `aws_acm_certificate_validation.strapi`                           |
|        | `aws_route53_record.strapi_validation[&quot;*.strapi.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.strapi_validation[&quot;strapi.cdssandbox.xyz&quot;]`   |
|        | `aws_route53_zone.strapi`                                         |
| update | `aws_alb.cms-load-balancer`                                       |
|        | `aws_alb_listener.front_end`                                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate.strapi will be created
  + resource "aws_acm_certificate" "strapi" {
      + arn                       = (known after apply)
      + domain_name               = "strapi.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.strapi.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "strapi.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.strapi.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "WebsiteCMS"
          + "Terrafrom"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "WebsiteCMS"
          + "Terrafrom"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.strapi will be created
  + resource "aws_acm_certificate_validation" "strapi" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb.cms-load-balancer will be updated in-place
  ~ resource "aws_alb" "cms-load-balancer" {
      ~ drop_invalid_header_fields       = false -> true
      ~ enable_deletion_protection       = false -> true
        id                               = "arn:aws:elasticloadbalancing:ca-central-1:773858180673:loadbalancer/app/cms-load-balancer/e07c3c5b348446cf"
        name                             = "cms-load-balancer"
      ~ tags                             = {
          + "CostCentre" = "WebsiteCMS"
          + "Terrafrom"  = "true"
        }
      ~ tags_all                         = {
          + "CostCentre" = "WebsiteCMS"
          + "Terrafrom"  = "true"
        }
        # (15 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_alb_listener.front_end will be updated in-place
  ~ resource "aws_alb_listener" "front_end" {
      + certificate_arn   = (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:773858180673:listener/app/cms-load-balancer/e07c3c5b348446cf/16e9f2242b915a40"
      ~ port              = 80 -> 443
      ~ protocol          = "HTTP" -> "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-0-2021-06"
      ~ tags              = {
          + "CostCentre" = "WebsiteCMS"
          + "Terrafrom"  = "true"
        }
      ~ tags_all          = {
          + "CostCentre" = "WebsiteCMS"
          + "Terrafrom"  = "true"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.strapi_validation["*.strapi.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "strapi_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.strapi_validation["strapi.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "strapi_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.strapi will be created
  + resource "aws_route53_zone" "strapi" {
      + arn           = (known after apply)
      + comment       = "Hosted zone for strapi.cdssandbox.xyz"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "strapi.cdssandbox.xyz"
      + name_servers  = (known after apply)
      + tags          = {
          + "CostCentre" = "WebsiteCMS"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "WebsiteCMS"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.strapi"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.cms-load-balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.front_end"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.s3_distribution"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.website-cms-database"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.image-repository"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.website-cms-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.website-cms-ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs-task-execution"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs-task-execution-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cw"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[1]"]
WARN -...
```

</details>
